CSI API ETABS v1
cPropLineSpring.SetLineSpringProp Method
 Creates a new named line spring property, or modifies an existing named line spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLineSpringProp(
	string Name,
	double U1,
	double U2,
	double U3,
	double R1,
	int NonlinearOption2,
	int NonlinearOption3,
	int color = 0,
	string notes = "",
	string iGUID = ""
)
Function SetLineSpringProp (
	Name As String,
	U1 As Double,
	U2 As Double,
	U3 As Double,
	R1 As Double,
	NonlinearOption2 As Integer,
	NonlinearOption3 As Integer,
	Optional color As Integer = 0,
	Optional notes As String = "",
	Optional iGUID As String = ""
) As Integer
Dim instance As cPropLineSpring
Dim Name As String
Dim U1 As Double
Dim U2 As Double
Dim U3 As Double
Dim R1 As Double
Dim NonlinearOption2 As Integer
Dim NonlinearOption3 As Integer
Dim color As Integer
Dim notes As String
Dim iGUID As String
Dim returnValue As Integer
returnValue = instance.SetLineSpringProp(Name,
	U1, U2, U3, R1, NonlinearOption2, NonlinearOption3,
	color, notes, iGUID)
int SetLineSpringProp(
	String^ Name,
	double U1,
	double U2,
	double U3,
	double R1,
	int NonlinearOption2,
	int NonlinearOption3,
	int color = 0,
	String^ notes = L"",
	String^ iGUID = L""
)
abstract SetLineSpringProp :
        Name : string *
        U1 : float *
        U2 : float *
        U3 : float *
        R1 : float *
        NonlinearOption2 : int *
        NonlinearOption3 : int *
        ?color : int *
        ?notes : string *
        ?iGUID : string
(* Defaults:
        let _color = defaultArg color 0
        let _notes = defaultArg notes ""
        let _iGUID = defaultArg iGUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of the line spring property. If this is an existing property, that property is modified; otherwise, a new property is added.
U1
Type: System.Double
 The spring stiffness per unit length in the local 1 direction [F/L2]
U2
Type: System.Double
 The spring stiffness per unit length in the local 2 direction [F/L2]
U3
Type: System.Double
 The spring stiffness per unit length in the local 3 direction [F/L2]
R1
Type: System.Double
 The rotational spring stiffness about local 1 [F/rad]
NonlinearOption2
Type: System.Int32
 The nonlinear option for the local 2 direction, this is one of the following values:
0 = (None) Linear - Resists Tension and Compression
1 = Resists Compression only
2 = Resists Tension only
NonlinearOption3
Type: System.Int32
 The nonlinear option for the local 3 direction, this is one of the following values:
0 = (None) Linear - Resists Tension and Compression
1 = Resists Compression only
2 = Resists Tension only
color (Optional)
Type: System.Int32
 The display color for the property specified as an integer
notes (Optional)
Type: System.String
 The notes, if any, assigned to the property
iGUID (Optional)
Type: System.String
 The GUID (global unique identifier), if any, assigned to the property
Return Value
Type: Int32
 Returns zero if the property is successfully set, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
    ret = SapModel.PropLineSpring.SetLineSpringProp("mySpringProp1", 0, 10, 20, 0, 0, 1)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropLineSpring Interface
ETABSv1 Namespace